app/controllers/events_controller.rb

SELECT "events".* FROM "events"
SELECT "members".* FROM "members"
---
  def index
    @events = Event.all
    @members = Member.all

SELECT "members".* FROM "members"
---
  def new
    @event = Event.new
    @members = Member.all

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "members".* FROM "members"
---
  def edit
    @event = Event.find(params[:id])
    @members = Member.all

INSERT INTO "events" ("created_at", "date", "member_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 03 May 2012 11:55:04 UTC +00:00], ["date", Thu, 03 May 2012], ["member_id", nil], ["updated_at", Thu, 03 May 2012 11:55:04 UTC +00:00]]
---
  def create
    @event = Event.new(params[:event])

    Notifier.event_email(@event).deliver

    respond_to do |format|
      if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "events" SET "date" = '2012-05-11', "updated_at" = '2012-05-07 21:33:56.686367' WHERE "events"."id" = 3
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])