app/controllers/members_controller.rb

  def create
    @member = Member.new(params[:member])

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 02 May 2012 22:29:25 UTC +00:00], ["email", "bruno.lui@bluesoft.com"], ["name", "Lui"], ["updated_at", Wed, 02 May 2012 22:29:25 UTC +00:00]]

  def destroy
    @member = Member.find(params[:id])
    @member.destroy
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 3]]